<?xml version="1.0" ?>
<net name="tf2onnx" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,30,42" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_98, input"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>30</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/sequential/lstm_2/zeros/Const:0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/sequential/lstm_2/zeros/Const:0" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/zeros/Const:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_2/zeros/Const:0"/>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/sequential/lstm/Shape:0" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm/Shape:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm/Shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/sequential/lstm/Shape__120:0" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm/Shape__120:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/sequential/lstm/Shape__120:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="const_axes__150" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_axes__150">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="const_ends__140" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_ends__140">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Broadcast_29" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_29, ShapeOf_28, StatefulPartitionedCall/sequential/lstm/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/sequential/lstm/strided_slice:0" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_29, Broadcast_365, ShapeOf_28, ShapeOf_364, StatefulPartitionedCall/sequential/lstm/strided_slice:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/sequential/lstm/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="const_fold_opt__184" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="18" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__184"/>
			</rt_info>
			<output>
				<port id="0" precision="I32" names="const_fold_opt__184">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/sequential/lstm/zeros_1/packed_Concat__130:0" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm/zeros_1/packed_Concat__130:0, const_fold_opt__184"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/sequential/lstm/zeros_1/packed_Concat__130:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/sequential/lstm/zeros_1__131:0" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm/zeros_1__131:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm/zeros_1__131:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/sequential/lstm/zeros:0" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm/zeros:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm/zeros:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Unsqueeze__59:0" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, Unsqueeze__59:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__59:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_2609" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Transpose_138" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_138"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_2616" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Transpose_140" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ShapeOf_105" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_105"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_109" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="46" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_109"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_106" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_106"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Gather_110" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_106, Gather_110"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_107" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_107"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Gather_108" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_106, Constant_107, Gather_108"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Broadcast_122" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_122"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Concat_101_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 42" offset="54" size="21504"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Concat_101" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Concat_104_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 64" offset="21558" size="32768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Concat_104" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Concat_121_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="54326" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Concat_121" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="LSTMSequence_181" type="LSTMSequence" version="opset5">
			<data direction="forward" hidden_size="64" activations="sigmoid, relu, relu" activations_alpha="" activations_beta="" clip="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_118, Concat_101, Concat_104, Concat_121, LSTMSequence_181, Split_100, Split_103, Split_117, Split_120"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>42</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>42</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_2573" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__64:0, ShapeOf_364, Squeeze__68:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Squeeze_2574" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__64:0, ShapeOf_364, Squeeze__68:0, StatefulPartitionedCall/sequential/lstm/transpose_1:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, Transpose_266, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm/transpose_1:0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/sequential/lstm_1/Shape:0" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_1/Shape:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm_1/Shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/sequential/lstm_1/Shape__138:0" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_1/Shape__138:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/sequential/lstm_1/Shape__138:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Broadcast_197" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_197, ShapeOf_196, StatefulPartitionedCall/sequential/lstm_1/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/sequential/lstm_1/strided_slice:0" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_197, Broadcast_365, ShapeOf_196, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_1/strided_slice:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/sequential/lstm_1/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="const_fold_opt__185" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="54838" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="const_fold_opt__185"/>
			</rt_info>
			<output>
				<port id="0" precision="I32" names="const_fold_opt__185">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/sequential/lstm_1/zeros/packed_Concat__154:0" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_1/zeros/packed_Concat__154:0, const_fold_opt__185"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/sequential/lstm_1/zeros/packed_Concat__154:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/sequential/lstm_1/zeros_1__149:0" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_1/zeros_1__149:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm_1/zeros_1__149:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/sequential/lstm_1/zeros:0" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_1/zeros:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_1/zeros:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Unsqueeze__80:0" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, Unsqueeze__80:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__80:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_2623" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Transpose_306" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_306"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_2630" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Transpose_308" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_308"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="ShapeOf_273" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_273"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_277" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="46" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_277"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_274" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_274"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Gather_278" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_274, Gather_278"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_275" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_275"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Gather_276" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_274, Constant_275, Gather_276"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Broadcast_290" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_290"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_269_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 64" offset="54842" size="65536"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Concat_269" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Concat_272_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512, 128" offset="120378" size="131072"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Concat_272" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Concat_289_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 512" offset="251450" size="1024"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Concat_289" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="LSTMSequence_349" type="LSTMSequence" version="opset5">
			<data direction="forward" hidden_size="128" activations="sigmoid, relu, relu" activations_alpha="" activations_beta="" clip="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_286, Concat_269, Concat_272, Concat_289, LSTMSequence_349, Split_268, Split_271, Split_285, Split_288"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>128</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_2580" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__85:0, ShapeOf_364, Squeeze__89:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Squeeze_2581" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__85:0, ShapeOf_364, Squeeze__89:0, StatefulPartitionedCall/sequential/lstm_1/transpose_1:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, Transpose_434, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_1/transpose_1:0">
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/sequential/lstm_2/Shape:0" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/Shape:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm_2/Shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/sequential/lstm_2/Shape__156:0" type="Convert" version="opset1">
			<data destination_type="i32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/Shape__156:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="StatefulPartitionedCall/sequential/lstm_2/Shape__156:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Broadcast_365" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/sequential/lstm_2/strided_slice:0" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32" names="StatefulPartitionedCall/sequential/lstm_2/strided_slice:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/sequential/lstm_2/zeros_1/packed_Concat__166:0" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/zeros_1/packed_Concat__166:0, const_fold_opt__184"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="StatefulPartitionedCall/sequential/lstm_2/zeros_1/packed_Concat__166:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/sequential/lstm_2/zeros_1__167:0" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/zeros_1__167:0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/sequential/lstm_2/zeros_1__167:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/sequential/lstm_2/zeros_1:0" type="Broadcast" version="opset3">
			<data mode="bidirectional"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/lstm_2/zeros_1:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32"/>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_2/zeros_1:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Unsqueeze__99:0" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, Unsqueeze__99:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Unsqueeze__99:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_2637" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transpose_474" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_474"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_2644" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="22" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Transpose_476" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_476"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="ShapeOf_441" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_441"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_445" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="46" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_445"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_442" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_442"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Gather_446" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_442, Gather_446"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_443" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="50" size="4"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_443"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Gather_444" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_442, Constant_443, Gather_444"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Broadcast_458" type="Broadcast" version="opset3">
			<data mode="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_458"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Concat_437_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 128" offset="252474" size="65536"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Concat_437" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Concat_440_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256, 64" offset="318010" size="32768"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Concat_440" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_457_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="350778" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Concat_457" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="LSTMSequence_517" type="LSTMSequence" version="opset5">
			<data direction="forward" hidden_size="64" activations="sigmoid, relu, relu" activations_alpha="" activations_beta="" clip="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_454, Concat_437, Concat_440, Concat_457, LSTMSequence_517, Split_436, Split_439, Split_453, Split_456"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_2587" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__107:0, ShapeOf_364, Squeeze__111:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Squeeze_2588" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__107:0, ShapeOf_364, Squeeze__111:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_2589" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="351290" size="24"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__107:0, ShapeOf_364, Squeeze__111:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Squeeze__111:0" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, LSTM__107:0, ShapeOf_364, Squeeze__111:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>30</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Squeeze__111:0">
					<dim>30</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="const_starts__174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="351314" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_527, StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0, const_axes__150"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_starts__174">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="const_ends__175" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="351322" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_527, StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0, const_axes__150"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="const_ends__175">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Broadcast_527" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="10" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_527, StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0, const_axes__150"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_527, StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0, const_axes__150"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>30</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_2/strided_slice_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/sequential/lstm_2/strided_slice_3__177:0" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_365, ShapeOf_364, StatefulPartitionedCall/sequential/lstm_2/strided_slice:0, StatefulPartitionedCall/sequential/lstm_2/strided_slice_3__177:0, const_axes__150, const_ends__140"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/sequential/lstm_2/strided_slice_3__177:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_2656_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 64" offset="351330" size="8192"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_2656" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp:0, StatefulPartitionedCall/sequential/dense/MatMul:0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
